In [1]:
import pandas as pd

a = pd.read_csv('house_level_flemms.csv')

In [6]:
a.head()

,CASE_ID,Bgy_Code,Construction Materials of the Outer Walls,Fuel for Lighting,Source of Water Supply for Drinking,Tenure Status of the Housing Unit/Lot,Sex,Single Year-Age Classification,Copy of Birth Certificate,Marital Status,Literacy,Highest Grade Completed,If graduate of Technical/Vocational Course,Overseas Worker
0,15707000010010000001000001,157001001,2,6.0,9.0,1.0,1.0,37.0,1.0,2.0,1.0,220.0,2.0,2.0
1,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,31.0,1.0,2.0,1.0,170.0,2.0,2.0
2,15707000010010000001000001,157001001,2,6.0,9.0,1.0,1.0,12.0,1.0,1.0,1.0,150.0,NaN,NaN
3,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,10.0,1.0,1.0,1.0,140.0,NaN,NaN
4,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,7.0,1.0,1.0,1.0,110.0,NaN,NaN

In [ ]:
a.info(verbose=True)

In [ ]:
len(a)

In [14]:
b = a.iloc[:,:6].drop_duplicates().reset_index(drop=True)

In [15]:
b.head()

,CASE_ID,Bgy_Code,Construction Materials of the Outer Walls,Fuel for Lighting,Source of Water Supply for Drinking,Tenure Status of the Housing Unit/Lot
0,15707000010010000001000001,157001001,2,6.0,9.0,1.0
1,15707000010010000002000002,157001001,2,6.0,9.0,1.0
2,15707000010010000003000003,157001001,2,6.0,9.0,1.0
3,15707000010010000004000004,157001001,2,6.0,9.0,1.0
4,15707000010010000005000005,157001001,2,6.0,9.0,1.0

In [18]:
b['Construction Materials of the Outer Walls'].value_counts()

2     354496
5     160944
1     102959
3      86599
4       8868
99      3659
8       3614
6       1872
9        866
10       330
11       228
7        147
Name: Construction Materials of the Outer Walls, dtype: int64

In [35]:
import numpy as np

condition1 = [(b['Construction Materials of the Outer Walls'] == 1),
              (b['Construction Materials of the Outer Walls'] == 3),
              (b['Construction Materials of the Outer Walls'] == 4),
              (b['Construction Materials of the Outer Walls'] == 6),
              (b['Construction Materials of the Outer Walls'] == 7)
             ]
b['Household with Concrete Walls Proportion'] = np.select(condition1, [1,1,1,1,1], 0)

In [36]:
b['Household with Concrete Walls Proportion'].value_counts()

0    524137
1    200445
Name: Concrete Walls Proportion, dtype: int64

In [37]:
b.head()

,CASE_ID,Bgy_Code,Construction Materials of the Outer Walls,Fuel for Lighting,Source of Water Supply for Drinking,Tenure Status of the Housing Unit/Lot,Concrete Walls Proportion
0,15707000010010000001000001,157001001,2,6.0,9.0,1.0,0
1,15707000010010000002000002,157001001,2,6.0,9.0,1.0,0
2,15707000010010000003000003,157001001,2,6.0,9.0,1.0,0
3,15707000010010000004000004,157001001,2,6.0,9.0,1.0,0
4,15707000010010000005000005,157001001,2,6.0,9.0,1.0,0

In [39]:
condition2 = [(b['Fuel for Lighting'] == 1.0)]
b['Access to Electricity Proportion'] = np.select(condition2, [1], 0)

In [44]:
condition3 = [(b['Source of Water Supply for Drinking'] == 1),
              (b['Source of Water Supply for Drinking'] == 2),
              (b['Source of Water Supply for Drinking'] == 7),
              (b['Source of Water Supply for Drinking'] == 11)
             ]
b['Access to Treated Water Proportion'] = np.select(condition3, [1,1,1,1], 0)

In [45]:
b['Access to Treated Water Proportion'].value_counts()

0    466438
1    258144
Name: Access to Treated Water Proportion, dtype: int64

In [48]:
condition4 = [(b['Tenure Status of the Housing Unit/Lot'] == 1)]
b['Owned House and Lot Proportion'] = np.select(condition4, [1], 0)

In [49]:
b['Owned House and Lot Proportion'].value_counts()

1    440519
0    284063
Name: Owned House and Lot Proportion, dtype: int64

In [12]:
c = a.iloc[:, list(range(2)) + [-1,-2,-3,-4,-5,-6,-7,-8]]

In [13]:
c.head()

,CASE_ID,Bgy_Code,Overseas Worker,If graduate of Technical/Vocational Course,Highest Grade Completed,Literacy,Marital Status,Copy of Birth Certificate,Single Year-Age Classification,Sex
0,15707000010010000001000001,157001001,2.0,2.0,220.0,1.0,2.0,1.0,37.0,1.0
1,15707000010010000001000001,157001001,2.0,2.0,170.0,1.0,2.0,1.0,31.0,2.0
2,15707000010010000001000001,157001001,NaN,NaN,150.0,1.0,1.0,1.0,12.0,1.0
3,15707000010010000001000001,157001001,NaN,NaN,140.0,1.0,1.0,1.0,10.0,2.0
4,15707000010010000001000001,157001001,NaN,NaN,110.0,1.0,1.0,1.0,7.0,2.0